package com.jzfq.retail.common.enmu;

public enum OrderErrCode {

                         /**==================== 用户操作错误，message可以直接返回给用户 ================*/

                         /**          通用异常        */
                         O_ERR_200000("200000", "系统异常,请稍后再试"),
                         /**          传入参数不能为空！        */
                         O_ERR_200001("200001", "传入参数不能为空!"),
                         /**          传入参数不正确！        */
                         O_ERR_200002("200002", "传入参数不正确！"),
                         /**          支付密码不正确！        */
                         O_ERR_200003("200003", "支付密码不正确!"),
                         /**          邀请码不可用！        */
                         O_ERR_200004("200004", "邀请码不可用!"),

                         /**==================== 用户操作错误，message可以直接返回给用户 end ================*/
                         
                         /**==================== app交互错误码 ====================*/
                         /**          登录失效，请重新登录！        */
                         O_ERR_1001("1001", "登录失效，请重新登录!"),
                         /**          小程序授权失效，请重新授权！        */
                         O_ERR_1002("1002", "小程序授权失败，请重新授权!"),
                         /**          请在认证激活后在我的>我的订单进行信用支付！        */
                         O_ERR_5000023("5000023", "请在认证激活后在我的>我的订单进行信用支付!"),
                         /**          您的信用账户未激活，先去认证激活账户吧！        */
                         O_ERR_5000020("5000020", "您的信用账户未激活，先去认证激活账户吧!"),
                         /**          您的信用账户被冻结!        */
                         O_ERR_5000099("5000099", "您的信用账户被冻结!"),
                         /**          汽车后市场资料未完善！        */
                         O_ERR_5000021("5000021", "汽车后市场资料未完善!"),
                         /**          个人信息不完善！        */
                         O_ERR_5000024("5000024", "个人信息不完善!"),
                         /**          个人信息信用额度不足,攒信用！        */
                         O_ERR_5000028("5000028", "个人信息信用额度不足,攒信用!"),
                         /**          有逾期账单！        */
                         O_ERR_5000029("5000029", "有逾期账单!"),
                         /**          学生-已毕业-提示切换工薪身份！        */
                         O_ERR_5000040("5000040", "学生-已毕业-提示切换工薪身份!"),
                         /**          学生-未毕业-提示暂时无法下分期订单！        */
                         O_ERR_5000041("5000041", "学生-未毕业-提示暂时无法下分期订单!"),

                         /**==================== 系统提示 ====================*/

                         /** 调用资方接口失败  */
                         O_ERR_300001("300001", "调用资方接口失败"),
                         /** 调用资方接口失败  */
                         O_ERR_300009("300009", "资方暂不支持此银行卡"),
                         /** 调用核心接口失败  */
                         O_ERR_300002("300002", "调用核心接口失败"),
                         /** 会员身份未认证，请先去认证  */
                         O_ERR_300003("300003", "会员身份未认证，请先去认证"),
                         /** 会员未激活，请先激活  */
                         O_ERR_300004("300004", "您的信用额度未激活，请先激活额度"),
                         /** 会员可用额度不足，请提升额度  */
                         O_ERR_300005("300005", "会员可用额度不足，请提升额度"),
                         /** 订单状态异常  */
                         O_ERR_300006("300006", "订单状态异常"),
                         /** 会员银行卡不支持  */
                         O_ERR_300008("300008", "会员银行卡不支持"),
                         /**          代理码已存在！                     */
                         O_ERR_300010("300010", "代理码已存在！"),
                         O_ERR_300011("300011", "请求风控同盾反欺诈失败！"),
                         O_ERR_300012("300012", "支付重复请求！"),
                         /**订单中商品重复 */
                         O_ERR_500001("500001", "订单中商品重复！"),
                         //风控异常状态码
                         /** 服务异常(风控返回  null)  */
                         O_ERR_400000("400000", "服务异常"),
                         /** code=4 用户所在城市未开通业务  */
                         O_ERR_400004("400004", "您所在的地区暂未开放当前业务，感谢您的关注"),
                         /** code=5 用户所在城市每日分期名额已满  */
                         O_ERR_400005("400005", "今日分期名额已抢完，请您择日再试"),
                         /** code=10 用户所下分期订单金额不符合要求  */
                         O_ERR_400010("400010", "当前订单不符分期条件，暂时无法完成交易"),
                         /** code=2 用户下单年龄不符  */
                         O_ERR_400002("400002", "您暂不符当前业务条件，感谢您的关注"),
                         /** code=1 gps地址必须打开，且传入gps 省市区地址  */
                         O_ERR_400001("5000025", "进行下一步需要GPS授权，请在设置中授权使用GPS定位"),
                        //风控重构-----风控异常状态码
                        /** fore=0 进件字段有缺失  */
                        O_ERR_800000("800000", "信息调取失败，请稍后再试"),
                        /** fore=1 近期有拒单  */
                        O_ERR_800001("800001", "您近期有不良信息，请过30天后再试"),
                        /** fore=2 有在审订单  */
                        O_ERR_800002("800002", "您还有未审核通过订单，请稍后再试"),
                        /** fore=3 当前有在还订单  */
                        O_ERR_800003("800003", "您还有未还款账单，请还款完成后再试"),
                        /** fore=4 客服年龄不符  */
//                        O_ERR_800004("800004", "您的年龄不符，暂时不可以下单"),
                        O_ERR_800004("800004", "很抱歉，您的身份信息不符合申请条件，无法办理"),
                        /** fore=5 客户民族不符  */
                        O_ERR_800005("800005", "很抱歉，您的身份信息不符合申请条件，无法办理"),
                        /** fore=6 客户身份证已过期  */
                        O_ERR_800006("800006", "您的身份证已过期，暂不可以下单"),
                        /** code=7 GPS信息未获取  */
                        O_ERR_800007("5000025", "信息调取失败，请稍后再试"),
                        /** code=8 未开通城市  */
                        O_ERR_800008("800008", "您的城市暂时不支持此商品配送"),
                        /** code=9 城市名额已满  */
                        O_ERR_800009("800009", "今日下单名额已满，请明天再试");

    private String code;
    private String errMsg;

    OrderErrCode(String code, String errMsg) {
        this.code = code;
        this.errMsg = errMsg;
    }

    public String getCode() {
        return code;
    }

    public String getErrMsg() {
        return errMsg;
    }
}
